Repository: jkitching/soft-brightness-plus
Catalog: po/*.po
Languages: fr

source: Soft Brightness Plus
fr: Luminosité logicielle

source: Use backlight control:
fr: Utiliser le rétroéclairage :

source: Monitor(s):
fr: Moniteur(s) :

source: All
fr: Tous

source: Built-in
fr: Interne

source: External
fr: Externes

source: Built-in monitor:
fr: Écran intégré :

source: Full-screen behavior:
fr: Comportement en plein-écran :

source: Do not enforce brightness in full-screen
fr: Ne pas changer la luminosité en plein-écran

source: Brightness enforced in full-screen
fr: Réglage de luminosité actif en plein-écran

source: Brightness enforced in full-screen, always tear-free
fr: Réglage de luminosité actif en plein-écran, mode sans-déchirures

source: Minimum brightness (0..1):
fr: Luminosité minimale (de 0 à 1) :

source: Mouse cursor brightness control:
fr: Contrôle de la luminosité du curseur de la souris :

source: Debug:
fr: Débogage :

source: Copyright © 2019-2022 Philippe Troin (<a href="https://github.com/F-i-f">F-i-f</a> on GitHub)
fr: Copyright © 2019-2022 Philippe Troin (<a href="https://github.com/F-i-f">F-i-f</a> sur GitHub)

source: Use backlight control.
fr: Utilisation du rétroéclairage.

source: Use the regular backlight control.
fr: Utiliser le rétroéclairage.

source: Monitors.
fr: Moniteurs.

source: The monitors whose brightness should be adjusted.
fr: Les moniteurs sur lesquels la luminosité sera changée.

source: Builtin monitor.
fr: Ecran intégré.

source: The name of the built-in monitor.
fr: Nom de l'écran intégré.

source: Prevent window unredirecting behavior.
fr: Eviter la non-redirection des fenêtres.

source: If set to never, unredirection is never prevented. If set to when-correcting, unredirection will be prevented when the brightness is not at the maximum setting (and an alpha layer is lowering the brightness). If set to always, window unredirection will always be prevented when this extension is active, allowing tear-free display.
fr: Si défini sur jamais, la non-redirection n'est jamais empêchée. Si défini sur quand correction, la non-redirection sera empêchée lorsque la luminosité n'est pas au réglage maximum (et une couche alpha diminue la luminosité). Si défini sur toujours, la non-redirection de fenêtre sera toujours empêchée lorsque cette extension est active, permettant un affichage sans déchirure.

source: Minimum brightness.
fr: Luminosité minimale.

source: Minimum brightness level.
fr: Niveau de luminosité minimale.

source: Current brightness level.
fr: Luminosité actuelle.

source: The current brightness level.
fr: La niveau de luminosité actif.

source: Mouse cursor brightness control.
fr: Contrôle de la luminosité du curseur de la souris.

source: When enabled, the mouse cursor follows the brightness setting. When disabled, the mouse cursor always remains at full brightness. Controlling mouse cursor brightness can sometimes show the wrong cursor and introduce cursor lag. You may want to disable it if you encounter cursor issues. Note that if another Gnome Shell component clones the mouse (like the Zoom accessibility feature), the cursor will follow the screen brightness.
fr: Lorsqu'il est activé, le curseur de la souris suit le paramètre de luminosité. Lorsque désactivé, le curseur de la souris reste toujours en pleine luminosité. Contrôle La luminosité du curseur de la souris peut parfois afficher le mauvais curseur et introduire que si un autre composant Gnome Shell clone la souris (comme le Zoom fonction d'accessibilité), le curseur suivra la luminosité de l'écran.

source: Debugging.
fr: Débogage.

source: Enable debugging for the extension.
fr: Activer le mode de débogage de l'extension.
